[
	{
		"lesson_id": "1",
		"id":[
			"FvcHoONPtLg"
		],
		"imgUrl": [
			"https://i.ytimg.com/vi/-vVYHcpU950/hqdefault.jpg?sqp=-oaymwE2CNACELwBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB_gmAAtAFigIMCAAQARgTIE4ofzAP&rs=AOn4CLD8CTvyH7rBR2IZaEdr4Z41Sp2Tfg"
		],
		"tests": [
			[
				{"text": "На рисунке схема дорог изображена в виде графа, в таблице содержатся сведения о длине этих дорог в километрах. Так как таблицу и схему рисовали независимо друг от друга, нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Известно, что длина дороги АГ меньше, чем длина дороги ВГ. Определите длину дороги ЕЖ. В ответе запишите целое число  — длину дороги в километрах."},
				{"img": "1_1.jpg"},
				{"img": "1_1.svg"}
			],
			[
				{"text": "На рисунке схема дорог изображена в виде графа, в таблице содержатся сведения о длине этих дорог в километрах. Так как таблицу и схему рисовали независимо друг от друга, нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите длину более длинной из дорог ГЖ и ЕИ. В ответе запишите целое число  — длину дороги в километрах."},
				{"img": "1_2.jpg"},
				{"img": "1_2.svg"}
			],
			[
				{"text": "На рисунке схема дорог изображена в виде графа, в таблице звёздочкой обозначено наличие дороги между населёнными пунктами. Отсутствие звёздочки означает, что такой дороги нет."},
				{"img": "1_4.jpg"},
				{"img": "1_4.svg"},
				{"text": "Так как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите, какие номера населённых пунктов соответствуют населённым пунктам Б и В. В ответе запишите эти два номера в порядке возрастания без пробелов и знаков препинания."}
			]
		]
	},
	{
		"lesson_id": "2",
		"id": [
			"VvPKUudi7sY"
		],
		"imgUrl": [
			"https://i.ytimg.com/vi/VvPKUudi7sY/hqdefault.jpg?sqp=-oaymwE2CPYBEIoBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB_gmAAtAFigIMCAAQARh_IF4oEzAP&rs=AOn4CLCCuvKeYRJmeAOItFgm_s_Kw1vGZw"
		],
		"tests": [
			[
				{"text": "Логическая функция F задаётся выражением (¬x ∧ ¬y) v (y ≡ z) v ¬w. Дан частично заполненный фрагмент, содержащий неповторяющиеся строки таблицы истинности функции F. Определите, какому столбцу таблицы истинности соответствует каждая из переменных x, y, z, w."},
				{"img" : "2_1.jpg"},
				{"text": "В ответе напишите буквы x, y, z, w в том порядке, в котором идут соответствующие им столбцы (сначала — буква, соответствующая первому столбцу; затем  — буква, соответствующая второму столбцу, и т. д.). Буквы в ответе пишите подряд, никаких разделителей между буквами ставить не нужно."},
				{"text": "Пример. Пусть задано выражение x → y, зависящее от двух переменных x и y, и фрагмент таблицы истинности:"},
				{"img" : "2.jpg"},
				{"text": "Тогда первому столбцу соответствует переменная y, а второму столбцу соответствует переменная x. В ответе нужно написать: yx."}
			],
			[
				{"text": "Логическая функция F задаётся выражением (x v y) ∧ ¬(y ≡ z) ∧ ¬w. На рисунке приведён частично заполненный фрагмент таблицы истинности функции F, содержащий неповторяющиеся строки. Определите, какому столбцу таблицы истинности функции F соответствует каждая из переменных x, y, z, w."},
				{"img" : "2_2.jpg"},
				{"text": "В ответе напишите буквы x, y, z, w в том порядке, в котором идут соответствующие им столбцы (сначала  — буква, соответствующая первому столбцу; затем  — буква, соответствующая второму столбцу, и т. д.). Буквы в ответе пишите подряд, никаких разделителей между буквами ставить не нужно."}
			],
			[
				{"text": "Логическая функция F задаётся выражением ((y → w) ≡ (x → ¬z)) ∧ (x v w). Дан частично заполненный фрагмент, содержащий неповторяющиеся строки таблицы истинности функции F. Определите, какому столбцу таблицы истинности соответствует каждая из переменных x, y, z, w."},
				{"img" : "2_3.jpg"},
				{"text": "В ответе напишите буквы x, y, z, w в том порядке, в котором идут соответствующие им столбцы (сначала буква, соответствующая первому столбцу; затем буква, соответствующая второму столбцу, и т. д.). Буквы в ответе пишите подряд, никаких разделителей между буквами ставить не нужно."}
			]
		]
	},
	{
		"lesson_id": "3",
		"id": [
			"2rLpGDTQqSU"
		],
		"imgUrl": [
			"https://i.ytimg.com/vi/2rLpGDTQqSU/hqdefault.jpg?sqp=-oaymwE2CPYBEIoBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB_gmAAtAFigIMCAAQARh_IF4oEzAP&rs=AOn4CLDKZFnuo6yIwtmiLM2GbNw_blHkiA"
		],
		"tests": [
			[	
				{"text": "В файле приведён фрагмент базы данных «Продукты» о поставках товаров в магазины районов города. База данных состоит из трёх таблиц."},
				{"href": "3_1.xlsx"},
				{"text": "Таблица «Движение товаров» содержит записи о поставках товаров в магазины в течение первой декады июня 2021 г., а также информацию о проданных товарах. Поле Тип операции содержит значение Поступление или Продажа, а в соответствующее поле Количество упаковок, шт. занесена информация о том, сколько упаковок товара поступило в магазин или было продано в течение дня. Таблица «Товар» содержит информацию об основных характеристиках каждого товара. Таблица «Магазин» содержит информацию о местонахождении магазинов."},
				{"img" : "3.png"},
				{"text": "Используя информацию из приведённой базы данных, определите, сколько килограмм творожка детского сладкого было продано в магазинах Заречного района за период с 1 по 10 июня включительно. В ответе запишите только число."}
			],
			[
				{"text": "В файле приведён фрагмент базы данных «Продукты» о поставках товаров в магазины районов города. База данных состоит из трёх таблиц."},
				{"href": "3_2.xlsx"},
				{"text": "Таблица «Движение товаров» содержит записи о поставках товаров в магазины в течение первой декады июня 2021 г., а также информацию о проданных товарах. Поле Тип операции содержит значение Поступление или Продажа, а в соответствующее поле Количество упаковок, шт. занесена информация о том, сколько упаковок товара поступило в магазин или было продано в течение дня. Таблица «Товар» содержит информацию об основных характеристиках каждого товара. Таблица «Магазин» содержит информацию о местонахождении магазинов."},
				{"img" : "3.png"},
				{"text": "Используя информацию из приведённой базы данных, определите на сколько увеличилось количество упаковок бурого риса, имеющихся в наличии в магазинах Октябрьского района, за период с 1 по 10 июня включительно. В ответе запишите только число."}
			],
			[
				{"text": "В файле приведён фрагмент базы данных «Продукты» о поставках товаров в магазины районов города. База данных состоит из трёх таблиц."},
				{"href": "3_3.xlsx"},
				{"text": "Таблица «Движение товаров» содержит записи о поставках товаров в магазины в течение первой декады июня 2021 г., а также информацию о проданных товарах. Поле Тип операции содержит значение Поступление или Продажа, а в соответствующее поле Количество упаковок, шт. занесена информация о том, сколько упаковок товара поступило в магазин или было продано в течение дня. Таблица «Товар» содержит информацию об основных характеристиках каждого товара. Таблица «Магазин» содержит информацию о местонахождении магазинов."},
				{"img" : "3.png"},
				{"text": "Используя информацию из приведённой базы данных, определите, сколько килограммов паштета из куриной печени было продано в магазинах Заречного района за период с 1 по 10 июня включительно. В ответе запишите только число."}
			]
		]
	},
	{
		"lesson_id": "4",
		"id": [
			"SGezFO5ZbKo"
		],
		"imgUrl": [
			"https://i.ytimg.com/vi/SGezFO5ZbKo/hqdefault.jpg?sqp=-oaymwE2CPYBEIoBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB_gmAAtAFigIMCAAQARgTIFAofzAP&rs=AOn4CLBeMRURXk2sWP-kqRTy0CqtxnMcJQ"
		],
		"tests": [
			[
				{"text": "Для кодирования некоторой последовательности, состоящей из букв А, Б, В и Г, решили использовать неравномерный двоичный код, позволяющий однозначно декодировать двоичную последовательность, появляющуюся на приёмной стороне канала связи. Для букв А, Б, В используются такие кодовые слова: А  — 010, Б  — 1, В  — 011."},
				{"text": "Укажите кратчайшее кодовое слово для буквы Г, при котором код будет допускать однозначное декодирование. Если таких кодов несколько, укажите код с наименьшим числовым значением."}
			],
			[
				{"text": "По каналу связи передаются сообщения, содержащие только буквы А, Б, В, Г, Д, Е. Для передачи используется неравномерный двоичный код, удовлетворяющий условию Фано; для букв A, Б, В используются такие кодовые слова: А  — 1, Б – 010, В – 001."},
				{"text": "Какова наименьшая возможная суммарная длина всех кодовых слов? Примечание. Условие Фано означает, что ни одно кодовое слово не является началом другого кодового слова. Коды, удовлетворяющие условию Фано, допускают однозначное декодирование."}
			],
			[
				{"text": "По каналу связи передаются сообщения, содержащие только семь букв: А, Б, Г, И, М, Р, Я. Для передачи используется двоичный код, удовлетворяющий условию Фано. Кодовые слова для некоторых букв известны: А  — 010, Б  — 011, И  — 10. Какое наименьшее количество двоичных знаков потребуется для кодирования слова ГРАММ?"},
				{"text": "Примечание. Условие Фано означает, что ни одно кодовое слово не является началом другого кодового слова."}
			]
		]
	},
	{
		"lesson_id": "5",
		"id": [
			"msq5_VQHOPA"
		],
		"imgUrl": [
			"https://i.ytimg.com/vi/msq5_VQHOPA/hqdefault.jpg?sqp=-oaymwE2CPYBEIoBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB_gmAAtAFigIMCAAQARh_IF8oEzAP&rs=AOn4CLDiLisMR-hKtkwp0NOk-LGJVD-ErQ"
		],
		"tests": [
			[
				{"text": "На вход алгоритма подаётся натуральное число N. Алгоритм строит по нему новое число R следующим образом."},
				{"text": "1.  Строится двоичная запись числа N."},
				{"text": "2.  К этой записи дописываются справа ещё два разряда по следующему правилу: складываются все цифры двоичной записи, если"},
				{"text": "а)  сумма нечетная к числу дописывается 11,"},
				{"text": "б)  сумма четная, дописывается 00."},
				{"text": "Полученная таким образом запись (в ней на два разряда больше, чем в записи исходного числа N) является двоичной записью искомого числа R. Укажите такое наименьшее число R, которое превышает 114 и может являться результатом работы алгоритма. В ответе это число запишите в десятичной системе счисления."}
			],
			[
				{"text": "Автомат обрабатывает натуральное число N по следующему алгоритму:"},
				{"text": "1.  Строится двоичная запись числа N."},
				{"text": "2.  В конец записи (справа) добавляется (дублируется) последняя цифра."},
				{"text": "3.  Складываются все цифры полученной двоичной записи. В конец записи (справа) дописывается остаток от деления суммы на 2."},
				{"text": "4.  Результат переводится в десятичную систему и выводится на экран."},
				{"text": "Пример. Дано число N = 13. Алгоритм работает следующим образом:"},
				{"text": "1.  Двоичная запись числа N: 1101."},
				{"text": "2.  Дублируется последняя цифра, новая запись 11011."},
				{"text": "3.  Сумма цифр полученной записи 4, остаток от деления на 2 равен 0, новая запись 110110."},
				{"text": "4.  На экран выводится число 54."},
				{"text": "Какое наименьшее число, большее 105, может появиться на экране в результате работы автомата?"}
			],
			[
				{"text": "Автомат получает на вход четырёхзначное число. По этому числу строится новое число по следующим правилам:"},
				{"text": "1.  Перемножаются первая и вторая, а также третья и четвёртая цифры исходного числа."},
				{"text": "2.  Полученные два числа записываются друг за другом в порядке убывания (без разделителей)."},
				{"text": "Пример. Исходное число: 2466. Произведения: 2 × 4 = 8; 6 × 6 = 36."},
				{"text": "Результат: 368."},
				{"text": "Укажите наименьшее число, в результате обработки которого автомат выдаст число 124."}
			]
		]
	},
	{
		"lesson_id": "6",
		"id": [
			"ve-Arg9qkHE"
		],
		"imgUrl": [
			"https://i.ytimg.com/vi/ve-Arg9qkHE/hqdefault.jpg?sqp=-oaymwE2CPYBEIoBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB_gmAAtAFigIMCAAQARgTIE8ofzAP&rs=AOn4CLBl2LkpMUggCPdG9rdGZi8kYqQOiQ"
		],
		"tests": [
			[
				{"text": "Исполнитель Черепаха действует на плоскости с декартовой системой координат. В начальный момент Черепаха находится в начале координат, её голова направлена вдоль положительного направления оси ординат, хвост опущен. При опущенном хвосте Черепаха оставляет на поле след в виде линии. В каждый конкретный момент известно положение исполнителя и направление его движения. У исполнителя существует две команды: Вперёд n (где n  — целое число), вызывающая передвижение Черепахи на n единиц в том направлении, куда указывает её голова, и Направо m (где m  — целое число), вызывающая изменение направления движения на m градусов по часовой стрелке. Запись"},
				{"text": "Повтори k [Команда1 Команда2 … КомандаS]"},
				{"text": "означает, что последовательность из S команд повторится k раз. Черепахе был дан для исполнения следующий алгоритм:"},
				{"text": "Повтори 4 [Вперёд 7 Направо 90 Вперёд 8 Направо 90]"},
				{"text": "Определите, сколько точек с целочисленными координатами будут находиться внутри области, ограниченной линией, заданной данным алгоритмом. Точки на линии учитывать не следует."}
			],
			[
				{"text": "Исполнитель Черепаха действует на плоскости с декартовой системой координат. В начальный момент Черепаха находится в начале координат, её голова направлена вдоль положительного направления оси ординат, хвост опущен. При опущенном хвосте Черепаха оставляет на поле след в виде линии. В каждый конкретный момент известно положение исполнителя и направление его движения. У исполнителя существует две команды: Вперёд n (где n  — целое число), вызывающая передвижение Черепахи на n единиц в том направлении, куда указывает её голова, и Направо m (где m  — целое число), вызывающая изменение направления движения на m градусов по часовой стрелке. Запись"},
				{"text": "Повтори k [Команда1 Команда2 … КомандаS]"},
				{"text": "означает, что последовательность из S команд повторится k раз. Черепахе был дан для исполнения следующий алгоритм:"},
				{"text": "Повтори 4 [Вперёд 9 Направо 90 Вперёд 7 Направо 90]"},
				{"text": "Определите, сколько точек с целочисленными координатами будут находиться внутри области, ограниченной линией, заданной данным алгоритмом. Точки на линии учитывать не следует."}
			],
			[
				{"text": "Исполнитель Черепаха действует на плоскости с декартовой системой координат. В начальный момент Черепаха находится в начале координат, её голова направлена вдоль положительного направления оси ординат, хвост опущен. При опущенном хвосте Черепаха оставляет на поле след в виде линии. В каждый конкретный момент известно положение исполнителя и направление его движения. У исполнителя существует две команды: Вперёд n (где n  — целое число), вызывающая передвижение Черепахи на n единиц в том направлении, куда указывает её голова, и Направо m (где m  — целое число), вызывающая изменение направления движения на m градусов по часовой стрелке. Запись"},
				{"text": "Повтори k [Команда1 Команда2 … КомандаS]"},
				{"text": "означает, что последовательность из S команд повторится k раз. Черепахе был дан для исполнения следующий алгоритм:"},
				{"text": "Повтори 5 [Вперёд 7 Направо 120]"},
				{"text": "Определите, сколько точек с целочисленными координатами будут находиться внутри области, ограниченной линией, заданной данным алгоритмом. Точки на линии учитывать не следует."}
			]
		]
	},
	{
		"lesson_id": "7",
		"id": [
			"uhwsXCYAnC0"
		],
		"imgUrl": [
			"https://i.ytimg.com/vi/uhwsXCYAnC0/hqdefault.jpg?sqp=-oaymwE2CPYBEIoBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB_gmAAtAFigIMCAAQARgTIE8ofzAP&rs=AOn4CLBkMO-fSmvwC6Zk5cbQu6-iBDmMjg"
		],
		"tests": [
			[
				{"text": "Для хранения произвольного растрового изображения размером 1024 × 1024 пикселей отведено 512 Кбайт памяти, при этом для каждого пикселя хранится двоичное число  — код цвета этого пикселя. Для каждого пикселя для хранения кода выделено одинаковое количество бит. Сжатие данных не производится. Какое максимальное количество цветов можно использовать в изображении?"}
			],
			[
				{"text": "Автоматическая фотокамера производит растровые изображения размером 800 на 600 пикселей. При этом объём файла с изображением не может превышать 500 Кбайт, упаковка данных не производится. Какое максимальное количество цветов можно использовать в палитре?"}
			],
			[
				{"text": "Музыкальный фрагмент был записан в формате стерео (двухканальная запись), оцифрован и сохранён в виде файла без использования сжатия данных. Размер полученного файла без учёта размера заголовка файла  — 48 Мбайт. Затем тот же музыкальный фрагмент был записан повторно в формате моно и оцифрован с разрешением в 1,5 раза выше и частотой дискретизации в 3 раза меньше, чем в первый раз. Сжатие данных не производилось. Укажите размер в Мбайт файла, полученного при повторной записи. В ответе запишите только целое число, единицу измерения писать не нужно. Искомый объём не учитывает размера заголовка файла."}
			]
		]
	},
	{
		"lesson_id": "8",
		"id": [
			"dFY-uay7BWE",
			"CQwMUiVymCE"
		],
		"imgUrl": [
			"https://i.ytimg.com/vi/dFY-uay7BWE/hqdefault.jpg?sqp=-oaymwE2CPYBEIoBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB_gmAAtAFigIMCAAQARh_IF4oEzAP&rs=AOn4CLDv4aPjHm1JjXz2vRr5Q2RGd2JSZA",
			"https://i.ytimg.com/vi/CQwMUiVymCE/hqdefault.jpg?sqp=-oaymwE2CPYBEIoBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB_gmAAtAFigIMCAAQARh_IF4oEzAP&rs=AOn4CLDyqqglIzmvwf2XZ8xyRwXI7kf9YA"
		],
		"tests": [
			[
				{"text": "Все 5-буквенные слова, составленные из букв А, Н, П, записаны в алфавитном порядке."},
				{"text": "Вот начало списка:"},
				{"text": "1.  ААААА"},
				{"text": "2.  ААААН"},
				{"text": "3.  ААААП"},
				{"text": "4.  АААНА"},
				{"text": "5.  АААНН"},
				{"text": "……"},
				{"text": "Запишите слово, которое стоит на 201-м месте от начала списка."}
			],
			[
				{"text": "Сколько слов длины 6, начинающихся и заканчивающихся согласной буквой, можно составить из букв Г, О, Д? Каждая буква может входить в слово несколько раз. Слова не обязательно должны быть осмысленными словами русского языка."}
			],
			[
				{"text": "Шифр кодового замка представляет собой последовательность из пяти символов, каждый из которых является цифрой от 1 до 4. Сколько различных вариантов шифра можно задать, если известно, что цифра 1 встречается ровно два раза, а каждая из других допустимых цифр может встречаться в шифре любое количество раз или не встречаться совсем?"}
			]
		]
	},
	{
		"lesson_id": "9",
		"id": [
			"UXswtOhNoHc"
		],
		"imgUrl": [
			"https://i.ytimg.com/vi/UXswtOhNoHc/hqdefault.jpg?sqp=-oaymwE2CPYBEIoBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB_gmAAtAFigIMCAAQARgjICgofzAP&rs=AOn4CLDnHXJXozdOqMryDeNkn9lh5LXcRw"
		],
		"tests": [
			[
				{"text": "Откройте файл электронной таблицы, содержащей вещественные числа  — результаты ежечасного измерения температуры воздуха на протяжении трёх месяцев."},
				{"href": "9_1.xlsx"},
				{"text": "Найдите разность между максимальным значением температуры и её средним арифметическим значением. В ответе запишите только целую часть получившегося числа."}
			],
			[
				{"text": "Откройте файл электронной таблицы, содержащей вещественные числа  — результаты ежечасного измерения температуры воздуха на протяжении трёх месяцев."},
				{"href": "9_2.xlsx"},
				{"text": "Сколько раз встречалась температура, которая равна максимальному значению?"}
			],
			[
				{"text": "Откройте файл электронной таблицы, содержащей вещественные числа  — результаты ежечасного измерения температуры воздуха на протяжении трёх месяцев."},
				{"href": "9_3.xlsx"},
				{"text": "Сколько раз встречалась температура, выше округленного до десятых среднего арифметического значения всех чисел в таблице?"}
			]
		]
	},
	{
		"lesson_id": "10",
		"id": [
			"Q7VCB8SDTjM"
		],
		"imgUrl": [
			"https://i.ytimg.com/vi/Q7VCB8SDTjM/hqdefault.jpg?sqp=-oaymwE2CPYBEIoBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB1AaAAuADigIMCAAQARgTIE8ofzAP&rs=AOn4CLCuMn-iWSS8lcE-wT6G8S2VuNos2w"
		],
		"tests": [
			[
				{"text": "С помощью текстового редактора определите, сколько раз, не считая сносок, встречается слово «ты» или «Ты» в тексте романа в стихах А. С. Пушкина «Евгений Онегин». Другие формы слова «ты», такие как «твой» и т. д., учитывать не следует. В ответе укажите только число."},
				{"href": "10_1.docx"}
			],
			[
				{"text": "С помощью текстового редактора определите, сколько раз, не считая сносок, встречается слово «север» или «Север» в тексте романа в стихах А. С. Пушкина «Евгений Онегин». Другие формы слова «север», такие как «севера», «северяне» и т. д., учитывать не следует. В ответе укажите только число."},
				{"href": "10_2.docx"}
			],
			[
				{"text": "С помощью текстового редактора определите, сколько раз, не считая сносок, встречается слово «день» или «День» в тексте романа в стихах А. С. Пушкина «Евгений Онегин». Другие формы слова «день», такие как «полдень», «дни» и т. д., учитывать не следует. В ответе укажите только число."},
				{"href": "10_3.docx"}
			]
		]
	},
	{
		"lesson_id": "11",
		"id": [
			"jyj8oPgnfyk"
		],
		"imgUrl": [
			"https://i.ytimg.com/vi/jyj8oPgnfyk/hqdefault.jpg?sqp=-oaymwE2CPYBEIoBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB1AaAAuADigIMCAAQARgWIGUoVzAP&rs=AOn4CLAZR_jB5uTk1UmFUAvPCXySMEjZNw"
		],
		"tests": [
			[
				{"text": "При регистрации в компьютерной системе каждому пользователю выдаётся пароль, состоящий из 20 символов и содержащий только символы из 12-символьного набора: А, В, C, D, Е, F, G, H, K, L, M, N. В базе данных для хранения сведений о каждом пользователе отведено одинаковое и минимально возможное целое число байт. При этом используют посимвольное кодирование паролей, все символы кодируют одинаковым и минимально возможным количеством бит. Кроме собственно пароля, для каждого пользователя в системе хранятся дополнительные сведения, для чего выделено целое число байт; это число одно и то же для всех пользователей."},
				{"text": "Для хранения сведений о 20 пользователях потребовалось 400 байт. Сколько байт выделено для хранения дополнительных сведений об одном пользователе? В ответе запишите только целое число – количество байт."}
			],
			[
				{"text": "При регистрации в компьютерной системе каждому пользователю выдаётся пароль, состоящий из 11 символов и содержащий только символы А, Б, В, Е, Ж, М, Н, Р, У, Я (таким образом, используется 10 различных символов). Каждый такой пароль в компьютерной системе записывается минимально возможным и одинаковым целым количеством байт (при этом используют посимвольное кодирование и все символы кодируются одинаковым и минимально возможным количеством бит). Укажите объём памяти в байтах, отводимый этой системой для записи 70 паролей."},
				{"text": "В ответе запишите только число, слово «байт» писать не нужно."}
			],
			[
				{"text": "При регистрации в компьютерной системе каждому пользователю выдаётся пароль, состоящий из 15 символов и содержащий только символы из 12 буквенного набора А, В, Е, К, М, Н, О, Р, С, Т, У, X. В базе данных для хранения сведений о каждом пользователе отведено одинаковое и минимально возможное целое число байт. При этом используют посимвольное кодирование паролей, все символы кодируются одинаковым и минимально возможным количеством бит. Кроме пароля для каждого пользователя в системе хранятся дополнительные сведения, для чего отведено 12 байт."},
				{"text": "Определите объём памяти, необходимый для хранения сведений о 50 пользователях. (Ответ дайте в байтах.)"}
			]
		]
	},
	{
		"lesson_id": "12",
		"id": [
			"xn85xnMQAHw"
		],
		"imgUrl": [
			"https://i.ytimg.com/vi/xn85xnMQAHw/hqdefault.jpg?sqp=-oaymwE2CPYBEIoBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB_gmAAtAFigIMCAAQARhWIBMofzAP&rs=AOn4CLDqAxEQP_I8X5GCwDzRiyI6AmBTmg"
		],
		"tests": [
			[

			],
			[

			],
			[

			],
			[

			],
			[

			]
		]
	},
	{
		"lesson_id": "13",
		"id": [
			"JZTwn3K0p_0"
		],
		"imgUrl": [
			"https://i.ytimg.com/vi/JZTwn3K0p_0/hqdefault.jpg?sqp=-oaymwE2CPYBEIoBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB_gmAAtAFigIMCAAQARgTIGUoWDAP&rs=AOn4CLCOXPKM3wekZaGmQVsD9X3b6agrHA"
		],
		"tests": [
			[

			],
			[

			],
			[

			],
			[

			],
			[

			]
		]
	},
	{
		"lesson_id": "14",
		"id": [
			"R8M6AFrLk3w"
		],
		"imgUrl": [
			"https://i.ytimg.com/vi/R8M6AFrLk3w/hqdefault.jpg?sqp=-oaymwE2CPYBEIoBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB_gmAAtAFigIMCAAQARhWIBMofzAP&rs=AOn4CLDK-VZCoaA2IEYXptfQ2hMSlznZwg"
		],
		"tests": [
			[

			],
			[

			],
			[

			],
			[

			],
			[

			]
		]
	},
	{
		"lesson_id": "15",
		"id": [
			"MMOcNrthPRA",
			"6nzCRHFYo0c"
		],
		"imgUrl": [
			"https://i.ytimg.com/vi/MMOcNrthPRA/hqdefault.jpg?sqp=-oaymwE2CPYBEIoBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB_gmAAtAFigIMCAAQARh_IF8oEzAP&rs=AOn4CLDNof69diouy34Cp_e2qplnnIuENw",
			"https://i.ytimg.com/vi/6nzCRHFYo0c/hqdefault.jpg?sqp=-oaymwE2CPYBEIoBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB_gmAAtAFigIMCAAQARgTIFAofzAP&rs=AOn4CLAXIGloi4DyxiqrPM4NVOc8NbzZ-w"
		],
		"tests": [
			[

			],
			[

			],
			[

			],
			[

			],
			[

			]
		]
	},
	{
		"lesson_id": "16",
		"id": [
			"SOXD2w8UVeY"
		],
		"imgUrl": [
			"https://i.ytimg.com/vi/SOXD2w8UVeY/hqdefault.jpg?sqp=-oaymwE2CPYBEIoBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB_gmAAtAFigIMCAAQARh_IF8oEzAP&rs=AOn4CLCHeF2Ts_mDw2-bfSPN0pYdP98JpA"
		],
		"tests": [
			[

			],
			[

			],
			[

			],
			[

			],
			[

			]
		]
	},
	{
		"lesson_id": "17",
		"id": [
			"M7CihEY7Zkg"
		],
		"imgUrl": [
			"https://i.ytimg.com/vi/M7CihEY7Zkg/hqdefault.jpg?sqp=-oaymwE2CPYBEIoBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB_gmAAtAFigIMCAAQARh_IF0oEzAP&rs=AOn4CLDPShHtDBca8rUAapA9QKlDBA4aDg"
		],
		"tests": [
			[

			],
			[

			],
			[

			],
			[

			],
			[

			]
		]
	},
	{
		"lesson_id": "18",
		"id": [
			"YKTrX1AcFnI"
		],
		"imgUrl": [
			"https://i.ytimg.com/vi/YKTrX1AcFnI/hqdefault.jpg?sqp=-oaymwE2CPYBEIoBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB_gmAAtAFigIMCAAQARh_IF0oEzAP&rs=AOn4CLC4QLcl0vqMyb-FdYiG7i22Hq6q2g"
		],
		"tests": [
			[

			],
			[

			],
			[

			],
			[

			],
			[

			]
		]
	},
	{
		"lesson_id": "19",
		"id": [
			"rlsaIo0drnQ"
		],
		"imgUrl": [
			"https://i.ytimg.com/vi/rlsaIo0drnQ/hqdefault.jpg?sqp=-oaymwE2CPYBEIoBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB_gmAAtAFigIMCAAQARh_IF0oEzAP&rs=AOn4CLBBTJBw0vOzz52P1s2uIRerxzpV2g"
		],
		"tests": [
			[

			],
			[

			],
			[

			],
			[

			],
			[

			]
		]
	},
	{
		"lesson_id": "20",
		"id": [
			"h4ySAgwDjjM"
		],
		"imgUrl": [
			"https://i.ytimg.com/vi/h4ySAgwDjjM/hqdefault.jpg?sqp=-oaymwE2CPYBEIoBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB_gmAAtAFigIMCAAQARh_IF8oEzAP&rs=AOn4CLAlb9jxDtfmMdg24oAtdzPVAArqAw"
		],
		"tests": [
			[

			],
			[

			],
			[

			],
			[

			],
			[

			]
		]
	},
	{
		"lesson_id": "21",
		"id": [
			"Dz49CKNifQw"
		],
		"imgUrl": [
			"https://i.ytimg.com/vi/Dz49CKNifQw/hqdefault.jpg?sqp=-oaymwE2CPYBEIoBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB_gmAAtAFigIMCAAQARh_IF8oEzAP&rs=AOn4CLCdBgA7XUWVlvGpdtXP5-lj5OIRHA"
		],
		"tests": [
			[

			],
			[

			],
			[

			],
			[

			],
			[

			]
		]
	},
	{
		"lesson_id": "22",
		"id": [
			"P4YBg-hwXPo"
		],
		"imgUrl": [
			"https://i.ytimg.com/vi/P4YBg-hwXPo/hq720.jpg?sqp=-oaymwEcCNAFEJQDSFXyq4qpAw4IARUAAIhCGAFwAcABBg==&rs=AOn4CLCVbowSyhEKyH5F711MtHa_mRwNhg"
		],
		"tests": [
			[

			],
			[

			],
			[

			],
			[

			],
			[

			]
		]
	},
	{
		"lesson_id": "23",
		"id": [
			"j5EX2ZFAmyw"
		],
		"imgUrl": [
			"https://i.ytimg.com/vi/j5EX2ZFAmyw/hqdefault.jpg?sqp=-oaymwE2CPYBEIoBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB_gmAAtAFigIMCAAQARh_IF0oEzAP&rs=AOn4CLDnX2-lsGra7V0g3VkBiIMU4hINDA"
		],
		"tests": [
			[

			],
			[

			],
			[

			],
			[

			],
			[

			]
		]
	},
	{
		"lesson_id": "24",
		"id": [
			"P98STAgOErw"
		],
		"imgUrl": [
			"https://i.ytimg.com/vi/P98STAgOErw/hqdefault.jpg?sqp=-oaymwE2CPYBEIoBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB_gmAAtAFigIMCAAQARh_IF0oEzAP&rs=AOn4CLBUkE4tKChbDtDE_UyJ5zMFd_gKKw"
		],
		"tests": [
			[

			],
			[

			],
			[

			],
			[

			],
			[

			]
		]
	},
	{
		"lesson_id": "25",
		"id": [
			"0kjScmAKGZU"
		],
		"imgUrl": [
			"https://i.ytimg.com/vi/0kjScmAKGZU/hqdefault.jpg?sqp=-oaymwE2CPYBEIoBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB_gmAAtAFigIMCAAQARh_IF0oEzAP&rs=AOn4CLCJlQKXEi5DNET4Zru7_NbM6vTY7Q"
		],
		"tests": [
			[

			],
			[

			],
			[

			],
			[

			],
			[

			]
		]
	},
	{
		"lesson_id": "26",
		"id": [
			"HwO5vFA1Ugo",
			"0Zfi95YfB8A"
		],
		"imgUrl": [
			"https://i.ytimg.com/vi/HwO5vFA1Ugo/hqdefault.jpg?sqp=-oaymwEcCPYBEIoBSFXyq4qpAw4IARUAAIhCGAFwAcABBg==&rs=AOn4CLAJ404eOtMSGTd2gyDw0lGyAeGuUg",
			"https://i.ytimg.com/vi/0Zfi95YfB8A/hqdefault.jpg?sqp=-oaymwE2CPYBEIoBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB1AaAAuADigIMCAAQARgnIBcofzAP&rs=AOn4CLAynnlx_RfJ_hWaFTzDjGof_cGm_A"
		],
		"tests": [
			[

			],
			[

			],
			[

			],
			[

			],
			[

			]
		]
	},
	{
		"lesson_id": "27",
		"id": [
			"uS57H1Qua0s",
			"Z0SoNqHCnuA"
		],
		"imgUrl": [
			"https://i.ytimg.com/vi/uS57H1Qua0s/hqdefault.jpg?sqp=-oaymwE2CPYBEIoBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB1AaAAuADigIMCAAQARgmIBYofzAP&rs=AOn4CLBBbAp1YTaCr1pe1R7UmffWAbloPw",
			"https://i.ytimg.com/vi/Z0SoNqHCnuA/hqdefault.jpg?sqp=-oaymwE2CPYBEIoBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB1AaAAuADigIMCAAQARhdIFkoZTAP&rs=AOn4CLDrhvB-706IZ41ng03l73sBEsjOfw"
		],
		"tests": [
			[

			],
			[

			],
			[

			],
			[

			],
			[

			]
		]
	}
]
