[
	[
		[
			{"text": "На рисунке слева изображена схема дорог N-ского района. В таблице звёздочкой обозначено наличие дороги из одного населённого пункта в другой. Отсутствие звёздочки означает, что такой дороги нет."},
			{"img": "1_1.jpg"},
			{"img": "1_2.svg"},
			{"text": "Каждому населённому пункту на схеме соответствует его номер в таблице, но неизвестно, какой именно номер. Определите, какие номера населённых пунктов в таблице могут соответствовать населённым пунктам E и F на схеме. В ответе запишите эти два номера в возрастающем порядке без пробелов и знаков препинания."}
		],
		[
			{"text": "Логическая функция F задаётся выражением ((x ∧ y) ∨ (y ∧ z)) ≡ ((x → w) ∧ (w → z)). Дан частично заполненный фрагмент, содержащий неповторяющиеся строки таблицы истинности функции F. Определите, какому столбцу таблицы истинности соответствует каждая из переменных x, y, z, w."},
			{"img": "2_1.jpg"},
			{"text": "В ответе напишите буквы x, y, z, w в том порядке, в котором идут соответствующие им столбцы (сначала  — буква, соответствующая первому столбцу; затем  — буква, соответствующая второму столбцу, и т. д.). Буквы в ответе пишите подряд, никаких разделителей между буквами ставить не нужно."},
			{"text": "Пример. Пусть задано выражение x → y, зависящее от двух переменных x и y, и фрагмент таблицы истинности:"},
			{"img": "2_2.jpg"},
			{"text": "Тогда первому столбцу соответствует переменная y, а второму столбцу соответствует переменная x. В ответе нужно написать: yx."}
		],
		[
			{"text": "В файле приведён фрагмент базы данных «Продукты», содержащей информацию о поставках товаров и их продаже. База данных состоит из трёх таблиц."},
			{"href": "3.xlsx"},
			{"text": "Таблица «Движение товаров» содержит записи о поставках товаров в магазины города в первой декаде июня 2021 г. и о продаже товаров в этот же период. Таблица «Товар» содержит данные о товарах. Таблица «Магазин» содержит адреса магазинов. На рисунке приведена схема базы данных, содержащая все поля каждой таблицы и связи между ними."},
			{"img": "3.png"},
			{"text": "Используя информацию из приведённой базы данных, определите общую стоимость продуктов, поставленных за указанный период с мелькомбината в магазины Заречного района. В ответе запишите целое число  — найденную общую стоимость в рублях."}
		],
		[
			{"text": "По каналу связи передаются сообщения, содержащие только семь букв: А, Б, В, Д, О, Р, Т. Для передачи используется двоичный код, удовлетворяющий условию Фано. Кодовые слова для некоторых букв известны: Б  — 01, Д  — 001, Р  — 100. Какое наименьшее количество двоичных знаков потребуется для кодирования слова ВОДОВОРОТ? Примечание. Условие Фано означает, что ни одно кодовое слово не является началом другого кодового слова."},
			{"text": "Примечание. Условие Фано означает, что ни одно кодовое слово не является началом другого кодового слова."}
		],
		[
			{"text": "Автомат обрабатывает натуральное число N > 1 по следующему алгоритму."},
			{"text": "1.  Строится двоичная запись числа N."},
			{"text": "2.  Последняя цифра двоичной записи удаляется."},
			{"text": "3.  Если исходное число N было нечётным, в конец записи (справа) дописываются цифры 10, если чётным  — 01."},
			{"text": "4.  Результат переводится в десятичную систему и выводится на экран."},
			{"text": "Пример. Дано число N = 13. Алгоритм работает следующим образом."},
			{"text": "1.  Двоичная запись числа N: 1101."},
			{"text": "2.  Удаляется последняя цифра, новая запись: 110."},
			{"text": "3.  Исходное число нечётно, дописываются цифры 10, новая запись: 11010."},
			{"text": "4.  На экран выводится число 26."},
			{"text": "Какое число нужно ввести в автомат, чтобы в результате получилось 2018?"}
		],
		[
			{"text": "Исполнитель Черепаха действует на плоскости с декартовой системой координат. В начальный момент Черепаха находится в начале координат, её голова направлена вдоль положительного направления оси ординат, хвост опущен. При опущенном хвосте Черепаха оставляет на поле след в виде линии. В каждый конкретный момент известно положение исполнителя и направление его движения. У исполнителя существует две команды: Вперёд n (где n  — целое число), вызывающая передвижение Черепахи на n единиц в том направлении, куда указывает её голова, и Направо m (где m  — целое число), вызывающая изменение направления движения на m градусов по часовой стрелке. Запись"},
			{"text": "Повтори k [Команда1 Команда2 … КомандаS]"},
			{"text": "означает, что последовательность из S команд повторится k раз. Черепахе был дан для исполнения следующий алгоритм:"},
			{"text": "Повтори 4 [Вперёд 7 Направо 90 Вперёд 8 Направо 90]"},
			{"text": "Определите, сколько точек с целочисленными координатами будут находиться внутри области, ограниченной линией, заданной данным алгоритмом. Точки на линии учитывать не следует."}
		],
		[
			{"text": "Музыкальный фрагмент был записан в формате квадро (четырёхканальная запись), оцифрован и сохранён в виде файла без использования сжатия данных. Размер полученного файла без учёта размера заголовка файла  — 12 Мбайт. Затем тот же музыкальный фрагмент был записан повторно в формате моно и оцифрован с разрешением в 2 раза выше и частотой дискретизации в 1,5 раза меньше, чем в первый раз. Сжатие данных не производилось. Укажите размер в Мбайт файла, полученного при повторной записи. В ответе запишите только целое число, единицу измерения писать не нужно. Искомый объём не учитывает размера заголовка файла."}
		],
		[
			{"text": "Найдите количество пятизначных восьмеричных чисел, в которых все цифры различны и никакие две четные или нечетные не стоят рядом."}
		],
		[
			{"text": "Откройте файл электронной таблицы, содержащей вещественные числа  — результаты ежечасного измерения температуры воздуха на протяжении трёх месяцев."},
			{"href": "9.xlsx"},
			{"text": "Сколько раз встречалась температура, которая была выше половины среднего арифметического значения, округленного до десятых, но ниже половины от максимального значения?"}
		],
		[
			{"text": "Откройте файл электронной таблицы, содержащей вещественные числа  — результаты ежечасного измерения температуры воздуха на протяжении трёх месяцев."},
			{"href": "10.xlsx"}
		]
	]
]